//wbserver.h
#pragma once

#include <WinSock2.h>
#pragma comment(lib, "ws2_32.lib")
#include  <ws2tcpip.h>

void DisplayMessage();

int recvn(SOCKET s, char* buf, int len, int flags);

DWORD __stdcall WorkThread(void* p);

DWORD __stdcall ListenThread(void* p);

/*--------------------------------------------------------------------------------
소켓 라이브러리 초기화
---------------------------------------------------------------------------------*/
bool wbserver_Init();

/*--------------------------------------------------------------------------------
소켓 라이브러리 종료
---------------------------------------------------------------------------------*/
void wbserver_Exit();

/*--------------------------------------------------------------------------------
대기 소켓 생성
socket(), bind(), listen()
ListenThread 함수 호출!
---------------------------------------------------------------------------------*/
bool wbserver_Start(int port);

/*--------------------------------------------------------------------------------
통신 소켓 종료(연결 종료)
---------------------------------------------------------------------------------*/
void wbserver_DisConnect();

/*--------------------------------------------------------------------------------
메시지 전송 함수
---------------------------------------------------------------------------------*/
int wbserver_SendData(SOCKET socket, const char* msg, int size);

int wbserver_RecvData(SOCKET socket, char* msg, int size);